mazent/STM32/Lib/cmsis_rtos/cmsis_os_freertos.c
/*
    +-----+                           +-----+
    |     |   put  +---------+  get   |     |
    |     +--------> spedite +-------->     |
    |     |        +---------+        |     |
    | MIT |                           | DST |
    |     |  alloc +---------+  free  |     |
    |     <--------+  libere <--------+     |
    |     |        +---------+        |     |
    +-----+                           +-----+
*/

typedef struct os_mailQ_cb {
    const osMailQDef_t * queue_def ;

    QueueHandle_t libere ;
    QueueHandle_t spedite ;
    uint8_t * mem ;
} os_mailQ_cb_t ;

osMailQId osMailCreate(
    const osMailQDef_t * queue_def,
    osThreadId thread_id)
{
    osMailQId mq = NULL ;
    os_mailQ_cb_t tmp = {
        .queue_def = queue_def
    } ;
    uint8_t * mail = NULL ;

    INUTILE(thread_id) ;

    ASSERT( !xPortInIsrContext() ) ;
    if ( xPortInIsrContext() ) {
        goto err1 ;
    }

    tmp.spedite = queue_create_and_register(queue_def->queue_sz,
                                            sizeof(void *),
                                            queue_def->nome_o) ;
    ASSERT(tmp.spedite) ;
    if ( NULL == tmp.spedite ) {
        goto err1 ;
    }

    tmp.libere = queue_create_and_register(queue_def->queue_sz,
                                           sizeof(void *),
                                           queue_def->nome_l) ;
    ASSERT(tmp.libere) ;
    if ( NULL == tmp.libere ) {
        goto err2 ;
    }

    tmp.mem = pvPortMalloc(queue_def->queue_sz * queue_def->item_sz) ;
    ASSERT(tmp.mem) ;
    if ( NULL == tmp.mem ) {
        goto err3 ;
    }

    // All'inizio tutte le mail sono disponibili
    mail = tmp.mem ;
    for ( uint32_t i = 0 ; i < queue_def->queue_sz ;
          i++, mail += queue_def->item_sz ) {
        (void) xQueueSend(tmp.libere, &mail, 0) ;
    }

    mq = pvPortMalloc( sizeof(os_mailQ_cb_t) ) ;
    ASSERT(mq) ;
    if ( NULL == mq ) {
        goto err4 ;
    }

    *mq = tmp ;
    goto err1 ;

err4:
    vPortFree(tmp.mem) ;
err3:
    vQueueDelete(tmp.libere) ;
err2:
    vQueueDelete(tmp.spedite) ;
err1:
    return mq ;
}

void * osMailAlloc(
    osMailQId queue_id,
    uint32_t millisec)
{
    void * mail = NULL ;

    ASSERT(queue_id) ;

    if ( NULL == queue_id ) {}
    else if ( xPortInIsrContext() ) {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE ;

        if ( pdFAIL ==
             xQueueReceiveFromISR(queue_id->libere, &mail,
                                  &xHigherPriorityTaskWoken) ) {
            DBG_ERR ;
            mail = NULL ;
        }

        portYIELD_FROM_ISR(xHigherPriorityTaskWoken) ;
    }
    else {
        (void) xQueueReceive(queue_id->libere, &mail, millisec) ;
    }

    return mail ;
}

void * osMailCAlloc(
    osMailQId queue_id,
    uint32_t millisec)
{
    void * mail = osMailAlloc(queue_id, millisec) ;
    if ( mail ) {
        memset_(mail, 0, queue_id->queue_def->item_sz) ;
    }

    return mail ;
}

osStatus osMailFree(
    osMailQId queue_id,
    void * mail)
{
    ASSERT(queue_id) ;
    ASSERT(mail) ;

    if ( NULL == queue_id ) {
        return osErrorParameter ;
    }
    else if ( NULL == mail ) {
        return osErrorParameter ;
    }
    else if ( xPortInIsrContext() ) {
        osStatus esito = osOK ;
        BaseType_t xHigherPriorityTaskWoken = pdFALSE ;

        if ( pdTRUE !=
             xQueueSendFromISR(queue_id->libere, &mail,
                               &xHigherPriorityTaskWoken) ) {
            DBG_ERR ;
            esito = osErrorOS ;
        }

        portYIELD_FROM_ISR(xHigherPriorityTaskWoken) ;

        return esito ;
    }
    else if ( pdTRUE == xQueueSend(queue_id->libere, &mail, 0) ) {
        return osOK ;
    }
    else {
        DBG_ERR ;
        return osErrorOS ;
    }
}

osStatus osMailPut(
    osMailQId queue_id,
    void * mail)
{
    ASSERT(queue_id) ;
    ASSERT(mail) ;

    if ( NULL == queue_id ) {
        return osErrorParameter ;
    }
    else if ( NULL == mail ) {
        return osErrorParameter ;
    }
    else if ( xPortInIsrContext() ) {
        osStatus esito = osOK ;
        BaseType_t xHigherPriorityTaskWoken = pdFALSE ;

        if ( pdTRUE !=
             xQueueSendFromISR(queue_id->spedite, &mail,
                               &xHigherPriorityTaskWoken) ) {
            esito = osErrorOS ;
        }

        portYIELD_FROM_ISR(xHigherPriorityTaskWoken) ;

        return esito ;
    }
    else if ( pdTRUE == xQueueSend(queue_id->spedite, &mail, 0) ) {
        return osOK ;
    }
    else {
        DBG_ERR ;
        return osErrorOS ;
    }
}

osEvent osMailGet(
    osMailQId queue_id,
    uint32_t millisec)
{
    osEvent event ;

    ASSERT(queue_id) ;

    if ( NULL == queue_id ) {
        event.status = osErrorParameter ;
    }
    else if ( xPortInIsrContext() ) {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE ;

        if ( xQueueReceiveFromISR(queue_id->spedite, &event.value.p,
                                  &xHigherPriorityTaskWoken) == pdTRUE ) {
            event.status = osEventMail ;
        }
        else {
            event.status = osOK ;
        }

        portYIELD_FROM_ISR(xHigherPriorityTaskWoken) ;
    }
    else {
        TickType_t attesa = ms_in_tick(millisec) ;

        event.status = pdTRUE ==
                       xQueueReceive(queue_id->spedite,
                                     &event.value.p, attesa) ?
                       osEventMail : osOK ;
    }

    return event ;
}

#endif  // Mail Queues available

/*********************************************
    Non fanno parte dell'interfaccia
    ma dipendono da freertos
*********************************************/

extern void xPortSysTickHandler(void) ;

void SysTick_Handler(void)
{
    HAL_IncTick() ;

#if INCLUDE_xTaskGetSchedulerState == 1
    if ( xTaskGetSchedulerState() != taskSCHEDULER_NOT_STARTED ) {
        xPortSysTickHandler() ;
    }
#else
#   error INCLUDE_xTaskGetSchedulerState deve valere 1
#endif
}


#if configAPPLICATION_ALLOCATED_HEAP == 1
// Lo stack tcp/ip usa
//     xPortGetMinimumEverFreeHeapSize
//     xPortGetFreeHeapSize
// che heap_3.c non ha
// Lo metto dove voglio io
USED
__attribute__( ( section(".heap_x") ) )
uint8_t ucHeap[configTOTAL_HEAP_SIZE] ;
#endif


#if configCHECK_FOR_STACK_OVERFLOW > 0

void vApplicationStackOverflowHook(
    TaskHandle_t xTask,
    char * pcTaskName)
{
    INUTILE(xTask) ;

    DBG_PRINTF("STACK OVERFLOW HOOK: %s \r\n", pcTaskName) ;

    BPOINT ;
}

#endif

#if configUSE_MALLOC_FAILED_HOOK == 1

void vApplicationMallocFailedHook(void)
{
    DBG_PUTS("MALLOC FAILED HOOK") ;

    BPOINT ;
}

#endif

#if configUSE_TICK_HOOK == 1

void vApplicationTickHook(void)
{}

#endif

#ifndef NDEBUG

#   ifdef traceMALLOC
void trace_malloc(
    void * p,
    size_t dim)
{
    ASSERT(p) ;

    DBG_PRINTF("%p = malloc(%zu)\n", p, dim) ;
}

#   endif

#   ifdef traceFREE
void trace_free(
    void * p,
    size_t dim)
{
    INUTILE(dim) ;

    DBG_PRINTF("free(%p)\n", p) ;
}

#   endif

#endif
